ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/R5SS_TMU_EXT_CORE1_78260000h.xml
<module name="TMU_EXT_CORE1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TMU_EXT_CORE1_REVISION" acronym="TMU_EXT_CORE1_REVISION" offset="0" width="32" description="IP revision id register.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="This identifies the scheme revision ID register type implemented for this module" range="31:30" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x0" description="Functional Release Number Reflects software-compatability. If there is no software compatability, a unique func number is assigned; for compatible modules, the same number is maintained." range="27:16" rwaccess="R"/>
	<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x0" description="Design Release Number Incremented for releases due to spec changes or post-release design changes. Reset to 0 when either MAJOR or MINOR is incremented." range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major Revision Number Represents major changes to the module [e.g. entirely new features are added/changed]. The major revision number for this module." range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom Module Number Indicates a special version of the module. May not be supported by standard software." range="7:6" rwaccess="R"/>
	<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor Revision Number Represents minor changes to the module [e.g. enhancements to existing features]. The minor revision number for this module." range="5:0" rwaccess="R"/>
	</register><register id="TMU_EXT_CORE1_SINPUF32_R0" acronym="TMU_EXT_CORE1_SINPUF32_R0" offset="64" width="32" description="Updates operand 1 for SINPUF32 operation. Result will be saved to R0.">
		<bitfield id="SINPUF32_R0" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger SINPUF32 operation Result will be saved to R0" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_SINPUF32_R1" acronym="TMU_EXT_CORE1_SINPUF32_R1" offset="72" width="32" description="Updates operand 1 for SINPUF32 operation. Result will be saved to R1.">
		<bitfield id="SINPUF32_R1" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger SINPUF32 operation Result will be saved to R1" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_SINPUF32_R2" acronym="TMU_EXT_CORE1_SINPUF32_R2" offset="80" width="32" description="Updates operand 1 for SINPUF32 operation. Result will be saved to R2.">
		<bitfield id="SINPUF32_R2" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger SINPUF32 operation Result will be saved to R2" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_SINPUF32_R3" acronym="TMU_EXT_CORE1_SINPUF32_R3" offset="88" width="32" description="Updates operand 1 for SINPUF32 operation. Result will be saved to R3.">
		<bitfield id="SINPUF32_R3" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger SINPUF32 operation Result will be saved to R3" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_SINPUF32_R4" acronym="TMU_EXT_CORE1_SINPUF32_R4" offset="96" width="32" description="Updates operand 1 for SINPUF32 operation. Result will be saved to R4.">
		<bitfield id="SINPUF32_R4" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger SINPUF32 operation Result will be saved to R4" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_SINPUF32_R5" acronym="TMU_EXT_CORE1_SINPUF32_R5" offset="104" width="32" description="Updates operand 1 for SINPUF32 operation. Result will be saved to R5.">
		<bitfield id="SINPUF32_R5" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger SINPUF32 operation Result will be saved to R5" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_SINPUF32_R6" acronym="TMU_EXT_CORE1_SINPUF32_R6" offset="112" width="32" description="Updates operand 1 for SINPUF32 operation. Result will be saved to R6.">
		<bitfield id="SINPUF32_R6" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger SINPUF32 operation Result will be saved to R6" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_SINPUF32_R7" acronym="TMU_EXT_CORE1_SINPUF32_R7" offset="120" width="32" description="Updates operand 1 for SINPUF32 operation. Result will be saved to R7.">
		<bitfield id="SINPUF32_R7" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger SINPUF32 operation Result will be saved to R7" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_COSPUF32_R0" acronym="TMU_EXT_CORE1_COSPUF32_R0" offset="128" width="32" description="Updates operand 1 for COSPUF32 operation. Result will be saved to R0.">
		<bitfield id="COSPUF32_R0" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger COSPUF32 operation Result will be saved to R0" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_COSPUF32_R1" acronym="TMU_EXT_CORE1_COSPUF32_R1" offset="136" width="32" description="Updates operand 1 for COSPUF32 operation. Result will be saved to R1.">
		<bitfield id="COSPUF32_R1" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger COSPUF32 operation Result will be saved to R1" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_COSPUF32_R2" acronym="TMU_EXT_CORE1_COSPUF32_R2" offset="144" width="32" description="Updates operand 1 for COSPUF32 operation. Result will be saved to R2.">
		<bitfield id="COSPUF32_R2" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger COSPUF32 operation Result will be saved to R2" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_COSPUF32_R3" acronym="TMU_EXT_CORE1_COSPUF32_R3" offset="152" width="32" description="Updates operand 1 for COSPUF32 operation. Result will be saved to R3.">
		<bitfield id="COSPUF32_R3" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger COSPUF32 operation Result will be saved to R3" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_COSPUF32_R4" acronym="TMU_EXT_CORE1_COSPUF32_R4" offset="160" width="32" description="Updates operand 1 for COSPUF32 operation. Result will be saved to R4.">
		<bitfield id="COSPUF32_R4" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger COSPUF32 operation Result will be saved to R4" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_COSPUF32_R5" acronym="TMU_EXT_CORE1_COSPUF32_R5" offset="168" width="32" description="Updates operand 1 for COSPUF32 operation. Result will be saved to R5.">
		<bitfield id="COSPUF32_R5" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger COSPUF32 operation Result will be saved to R5" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_COSPUF32_R6" acronym="TMU_EXT_CORE1_COSPUF32_R6" offset="176" width="32" description="Updates operand 1 for COSPUF32 operation. Result will be saved to R6.">
		<bitfield id="COSPUF32_R6" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger COSPUF32 operation Result will be saved to R6" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_COSPUF32_R7" acronym="TMU_EXT_CORE1_COSPUF32_R7" offset="184" width="32" description="Updates operand 1 for COSPUF32 operation. Result will be saved to R7.">
		<bitfield id="COSPUF32_R7" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger COSPUF32 operation Result will be saved to R7" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_ATANPUF32_R0" acronym="TMU_EXT_CORE1_ATANPUF32_R0" offset="192" width="32" description="Updates operand 1 for ATANPUF32 operation. Result will be saved to R0.">
		<bitfield id="ATANPUF32_R0" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger ATANPUF32 operation Result will be saved to R0" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_ATANPUF32_R1" acronym="TMU_EXT_CORE1_ATANPUF32_R1" offset="200" width="32" description="Updates operand 1 for ATANPUF32 operation. Result will be saved to R1.">
		<bitfield id="ATANPUF32_R1" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger ATANPUF32 operation Result will be saved to R1" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_ATANPUF32_R2" acronym="TMU_EXT_CORE1_ATANPUF32_R2" offset="208" width="32" description="Updates operand 1 for ATANPUF32 operation. Result will be saved to R2.">
		<bitfield id="ATANPUF32_R2" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger ATANPUF32 operation Result will be saved to R2" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_ATANPUF32_R3" acronym="TMU_EXT_CORE1_ATANPUF32_R3" offset="216" width="32" description="Updates operand 1 for ATANPUF32 operation. Result will be saved to R3.">
		<bitfield id="ATANPUF32_R3" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger ATANPUF32 operation Result will be saved to R3" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_ATANPUF32_R4" acronym="TMU_EXT_CORE1_ATANPUF32_R4" offset="224" width="32" description="Updates operand 1 for ATANPUF32 operation. Result will be saved to R4.">
		<bitfield id="ATANPUF32_R4" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger ATANPUF32 operation Result will be saved to R4" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_ATANPUF32_R5" acronym="TMU_EXT_CORE1_ATANPUF32_R5" offset="232" width="32" description="Updates operand 1 for ATANPUF32 operation. Result will be saved to R5.">
		<bitfield id="ATANPUF32_R5" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger ATANPUF32 operation Result will be saved to R5" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_ATANPUF32_R6" acronym="TMU_EXT_CORE1_ATANPUF32_R6" offset="240" width="32" description="Updates operand 1 for ATANPUF32 operation. Result will be saved to R6.">
		<bitfield id="ATANPUF32_R6" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger ATANPUF32 operation Result will be saved to R6" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_ATANPUF32_R7" acronym="TMU_EXT_CORE1_ATANPUF32_R7" offset="248" width="32" description="Updates operand 1 for ATANPUF32 operation. Result will be saved to R7.">
		<bitfield id="ATANPUF32_R7" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger ATANPUF32 operation Result will be saved to R7" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_IEXP2F32_R0" acronym="TMU_EXT_CORE1_IEXP2F32_R0" offset="320" width="32" description="Updates operand 1 for IEXP2F32 operation. Result will be saved to R0.">
		<bitfield id="IEXP2F32_R0" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger IEXP2F32 operation Result will be saved to R0" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_IEXP2F32_R1" acronym="TMU_EXT_CORE1_IEXP2F32_R1" offset="328" width="32" description="Updates operand 1 for IEXP2F32 operation. Result will be saved to R1.">
		<bitfield id="IEXP2F32_R1" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger IEXP2F32 operation Result will be saved to R1" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_IEXP2F32_R2" acronym="TMU_EXT_CORE1_IEXP2F32_R2" offset="336" width="32" description="Updates operand 1 for IEXP2F32 operation. Result will be saved to R2.">
		<bitfield id="IEXP2F32_R2" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger IEXP2F32 operation Result will be saved to R2" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_IEXP2F32_R3" acronym="TMU_EXT_CORE1_IEXP2F32_R3" offset="344" width="32" description="Updates operand 1 for IEXP2F32 operation. Result will be saved to R3.">
		<bitfield id="IEXP2F32_R3" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger IEXP2F32 operation Result will be saved to R3" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_IEXP2F32_R4" acronym="TMU_EXT_CORE1_IEXP2F32_R4" offset="352" width="32" description="Updates operand 1 for IEXP2F32 operation. Result will be saved to R4.">
		<bitfield id="IEXP2F32_R4" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger IEXP2F32 operation Result will be saved to R4" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_IEXP2F32_R5" acronym="TMU_EXT_CORE1_IEXP2F32_R5" offset="360" width="32" description="Updates operand 1 for IEXP2F32 operation. Result will be saved to R5.">
		<bitfield id="IEXP2F32_R5" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger IEXP2F32 operation Result will be saved to R5" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_IEXP2F32_R6" acronym="TMU_EXT_CORE1_IEXP2F32_R6" offset="368" width="32" description="Updates operand 1 for IEXP2F32 operation. Result will be saved to R6.">
		<bitfield id="IEXP2F32_R6" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger IEXP2F32 operation Result will be saved to R6" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_IEXP2F32_R7" acronym="TMU_EXT_CORE1_IEXP2F32_R7" offset="376" width="32" description="Updates operand 1 for IEXP2F32 operation. Result will be saved to R7.">
		<bitfield id="IEXP2F32_R7" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger IEXP2F32 operation Result will be saved to R7" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_LOG2F32_R0" acronym="TMU_EXT_CORE1_LOG2F32_R0" offset="384" width="32" description="Updates operand 1 for LOG2F32 operation. Result will be saved to R0.">
		<bitfield id="LOG2F32_R0" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger LOG2F32 operation Result will be saved to R0" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_LOG2F32_R1" acronym="TMU_EXT_CORE1_LOG2F32_R1" offset="392" width="32" description="Updates operand 1 for LOG2F32 operation. Result will be saved to R1.">
		<bitfield id="LOG2F32_R1" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger LOG2F32 operation Result will be saved to R1" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_LOG2F32_R2" acronym="TMU_EXT_CORE1_LOG2F32_R2" offset="400" width="32" description="Updates operand 1 for LOG2F32 operation. Result will be saved to R2.">
		<bitfield id="LOG2F32_R2" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger LOG2F32 operation Result will be saved to R2" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_LOG2F32_R3" acronym="TMU_EXT_CORE1_LOG2F32_R3" offset="408" width="32" description="Updates operand 1 for LOG2F32 operation. Result will be saved to R3.">
		<bitfield id="LOG2F32_R3" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger LOG2F32 operation Result will be saved to R3" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_LOG2F32_R4" acronym="TMU_EXT_CORE1_LOG2F32_R4" offset="416" width="32" description="Updates operand 1 for LOG2F32 operation. Result will be saved to R4.">
		<bitfield id="LOG2F32_R4" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger LOG2F32 operation Result will be saved to R4" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_LOG2F32_R5" acronym="TMU_EXT_CORE1_LOG2F32_R5" offset="424" width="32" description="Updates operand 1 for LOG2F32 operation. Result will be saved to R5.">
		<bitfield id="LOG2F32_R5" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger LOG2F32 operation Result will be saved to R5" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_LOG2F32_R6" acronym="TMU_EXT_CORE1_LOG2F32_R6" offset="432" width="32" description="Updates operand 1 for LOG2F32 operation. Result will be saved to R6.">
		<bitfield id="LOG2F32_R6" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger LOG2F32 operation Result will be saved to R6" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_LOG2F32_R7" acronym="TMU_EXT_CORE1_LOG2F32_R7" offset="440" width="32" description="Updates operand 1 for LOG2F32 operation. Result will be saved to R7.">
		<bitfield id="LOG2F32_R7" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Update will trigger LOG2F32 operation Result will be saved to R7" range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_QUADF32_X_R0_R1" acronym="TMU_EXT_CORE1_QUADF32_X_R0_R1" offset="448" width="32" description="Updates operand 1 (X) for QUADF32 operation. Result will be saved to R0 and R1.">
		<bitfield id="QUADF32_X_R0_R1" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Operand 2 must be written first by Writing to register QUADF32_Y Update will trigger QUADF32 operation Result will be saved to R0 and R1 " range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_QUADF32_X_R1_R2" acronym="TMU_EXT_CORE1_QUADF32_X_R1_R2" offset="456" width="32" description="Updates operand 1 (X) for QUADF32 operation. Result will be saved to R1 and R2.">
		<bitfield id="QUADF32_X_R1_R2" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Operand 2 must be written first by Writing to register QUADF32_Y Update will trigger QUADF32 operation Result will be saved to R1 and R2 " range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_QUADF32_X_R2_R3" acronym="TMU_EXT_CORE1_QUADF32_X_R2_R3" offset="464" width="32" description="Updates operand 1 (X) for QUADF32 operation. Result will be saved to R2 and R3.">
		<bitfield id="QUADF32_X_R2_R3" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Operand 2 must be written first by Writing to register QUADF32_Y Update will trigger QUADF32 operation Result will be saved to R2 and R3 " range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_QUADF32_X_R3_R4" acronym="TMU_EXT_CORE1_QUADF32_X_R3_R4" offset="472" width="32" description="Updates operand 1 (X) for QUADF32 operation. Result will be saved to R3 and R4.">
		<bitfield id="QUADF32_X_R3_R4" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Operand 2 must be written first by Writing to register QUADF32_Y Update will trigger QUADF32 operation Result will be saved to R3 and R4 " range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_QUADF32_X_R4_R5" acronym="TMU_EXT_CORE1_QUADF32_X_R4_R5" offset="480" width="32" description="Updates operand 1 (X) for QUADF32 operation. Result will be saved to R4 and R5.">
		<bitfield id="QUADF32_X_R4_R5" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Operand 2 must be written first by Writing to register QUADF32_Y Update will trigger QUADF32 operation Result will be saved to R4 and R5 " range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_QUADF32_X_R5SS0_R6" acronym="TMU_EXT_CORE1_QUADF32_X_R5SS0_R6" offset="488" width="32" description="Updates operand 1 (X) for QUADF32 operation. Result will be saved to R5 and R6.">
		<bitfield id="QUADF32_X_R5_R6" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Operand 2 must be written first by Writing to register QUADF32_Y Update will trigger QUADF32 operation Result will be saved to R5 and R6 " range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_QUADF32_X_R6_R7" acronym="TMU_EXT_CORE1_QUADF32_X_R6_R7" offset="496" width="32" description="Updates operand 1 (X) for QUADF32 operation. Result will be saved to R6 and R7.">
		<bitfield id="QUADF32_X_R6_R7" width="32" begin="31" end="0" resetval="0x0" description="Write to this register will update Operand 1  Operand 2 must be written first by Writing to register QUADF32_Y Update will trigger QUADF32 operation Result will be saved to R6 and R7 " range="31:0" rwaccess="R/W"/>
	</register><register id="TMU_EXT_CORE1_RESULT_R0" acronym="TMU_EXT_CORE1_RESULT_R0" offset="640" width="32" description="R0 result register.">
		<bitfield id="R0" width="32" begin="31" end="0" resetval="0x0" description="R0 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_EXT_CORE1_RESULT_R1" acronym="TMU_EXT_CORE1_RESULT_R1" offset="648" width="32" description="R1 result register.">
		<bitfield id="R1" width="32" begin="31" end="0" resetval="0x0" description="R1 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_EXT_CORE1_RESULT_R2" acronym="TMU_EXT_CORE1_RESULT_R2" offset="656" width="32" description="R2 result register.">
		<bitfield id="R2" width="32" begin="31" end="0" resetval="0x0" description="R2 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_EXT_CORE1_RESULT_R3" acronym="TMU_EXT_CORE1_RESULT_R3" offset="664" width="32" description="R3 result register.">
		<bitfield id="R3" width="32" begin="31" end="0" resetval="0x0" description="R3 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_EXT_CORE1_RESULT_R4" acronym="TMU_EXT_CORE1_RESULT_R4" offset="672" width="32" description="R4 result register.">
		<bitfield id="R4" width="32" begin="31" end="0" resetval="0x0" description="R4 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_EXT_CORE1_RESULT_R5" acronym="TMU_EXT_CORE1_RESULT_R5" offset="680" width="32" description="R5 result register.">
